Реализовать две функции:

    Одна функция в пакете в бизнес-логики, можно, например, в internal/service, которая будет вызываться из main() по некоторому интервалу и которая будет создавать разные существующие в программе структуры из internal/model и передавать их в другую функцию слоя internal/repository;
    Вторая функция из слоя internal/repository, которая будет принимать разные структуры, должна проверить их тип и распределить их по разным слайсам, предварительно инициализированным в пакете;
    Важно применить в реализации соответствие структур одному интерфейсу и разработать логику проверки реального типа передаваемого в функцию интерфейса и добавление в соответствующий ее типу слайс.

 